[
    {
        "id": "ferrari_f40",
        "name": "Ferrari F40",
        "year": 1987,
        "topSpeed": 327,
        "horsepower": 478,
        "cylinders": 8,
        "acceleration": 4.1,
        "cc": 2936,
        "image": "/media/Ferrari-F40.avif",
        "description": "The F40 was built to celebrate Ferrari’s 40th anniversary. A very fast berlinetta designed by Pininfarina, it was built mainly from composites. Its sophisticated high-performance, turbo-charged running gear combined with a first class chassis gave it the kind of great dynamic prowess that was close to that of a racing car."
    },
    {
        "id": "ferrari_f50",
        "name": "Ferrari F50",
        "year": 1995,
        "topSpeed": 325,
        "horsepower": 519,
        "cylinders": 12,
        "acceleration": 3.7,
        "cc": 4698,
        "image": "/media/Ferrari-F50.webp",
        "description": "Created to celebrate Ferrari’s 50th anniversary, the F50 was the closest thing to a road-going Formula 1 car the company had ever built. Given its uncompromising, purist approach to high performance, the F50 was devoid of power steering, power assisted braking and ABS, but made extensive use of sophisticated composite materials, F1-style construction technology and aerodynamics."
    },
    {
        "id": "ferrari_360_modena",
        "name": "Ferrari 360 Modena",
        "year": 1999,
        "topSpeed": 295,
        "horsepower": 400,
        "cylinders": 8,
        "acceleration": 4.5,
        "cc": 3586,
        "image": "/media/ferrari-360.jpeg",
        "description": "The 360 Modena is a clean-sheet design which anticipates trends for future Ferrari road cars. These include lower weight combined with greater chassis rigidity – seemingly contrasting objectives that have been achieved by employing innovative construction technology."
    },
    {
        "id": "ferrari_355_berlinetta",
        "name": "Ferrari 355 Berlinetta",
        "year": 1994,
        "topSpeed": 295,
        "horsepower": 375,
        "cylinders": 8,
        "acceleration": 4.7,
        "cc": 3496,
        "image": "/media/F355-berlinetta.jpg",
        "description": "Unveiled at a dedicated client event at Fiorano in May 1994,the F355 Berlinetta quickly became the benchmark in its class. The increased power of the new 5-valve per cylinder V8 was complemented by a truly exceptional chassis, with extremely efficient, electronically controlled suspension."
    },
    {
        "id": "ferrari_550_maranello",
        "name": "Ferrari 550 Maranello",
        "year": 1996,
        "topSpeed": 320,
        "horsepower": 485,
        "cylinders": 12,
        "acceleration": 4.4,
        "cc": 5474,
        "image": "/media/550-maranello.jpg",
        "description": "Launched to the press at the Nürburgring in 1996, the 550 Maranello was Ferrari’s answer to those who believed the performance of a front-engined V12 car could not beat that of a mid-engined sports car. The successor to the F512M, the 550 Maranello proved quicker and, thanks to its better front-engined, rear drive packaging layout, far more practical."
    },
    {
        "id": "ferrari_f355_gts",
        "name": "Ferrari F355 GTS",
        "year": 1995,
        "topSpeed": 295,
        "horsepower": 375,
        "cylinders": 8,
        "acceleration": 4.7,
        "cc": 3496,
        "image": "/media/F355-gts.avif",
        "description": "Along the lines of the earlier Targa top, this open version of the F355 had a hard top that could be stowed away behind the seats. The F355 GTS featured a stress-bearing semi-monocoque steel chassis with variable-section, tubular front and rear sub-frames and electronically controlled suspension. The V8 engine produced a specific power of 109 bhp per litre and, mated to a close-ratio 6-speed gearbox, ensured performance."
    },
    {
        "id": "ferrari_348_gtb",
        "name": "Ferrari 348 GTB",
        "year": 1993,
        "topSpeed": 275,
        "horsepower": 320,
        "cylinders": 8,
        "acceleration": 5.6,
        "cc": 3405,
        "image": "/media/Ferrari-348.jpg",
        "description": "Modified from the 348 TB, the 348 GTB was a two-seater berlinetta with dynamic performance characteristics worthy of the marque’s highest traditions. Its sports orientation was best expressed on the track, as proven by the 348 Challenge, which saw this car race on circuits in Europe and the US. Its styling was harmonious and aerodynamically efficient, and the mid-mounted V8 engine ensured perfect weight distribution and class-beating power."
    },
    {
        "id": "ferrari_512_tr",
        "name": "Ferrari 512 TR",
        "year": 1991,
        "topSpeed": 313,
        "horsepower": 428,
        "cylinders": 12,
        "acceleration": 4.8,
        "cc": 4943,
        "image": "/media/Ferrari-512-TR.jpeg",
        "description": "The 512 TR was the evolution of the Testarossa and production started in 1991. The interior was redesigned to increase comfort and ergonomics and the exterior facelift was designed to improve aerodynamics."
    },
    {
        "id": "ferrari_328_gtb",
        "name": "Ferrari 328 GTB",
        "year": 1985,
        "topSpeed": 263,
        "horsepower": 270,
        "cylinders": 8,
        "acceleration": 6.0,
        "cc": 3185,
        "image": "/media/328-gtb.jpg",
        "description": "The 308 series had won universal acclaim from both customers and critics, and its natural evolution continued with the 328 GTB, a berlinetta fitted with the new 3.2-litre version of the V8. This new engine (again featuring four valves per cylinder) produced a specific output of 85 bhp per litre, compared with 82 for the 4-valve version of the 308."
    },
    {
        "id": "ferrari_gto",
        "name": "Ferrari GTO",
        "year": 1984,
        "topSpeed": 305,
        "horsepower": 400,
        "cylinders": 8,
        "acceleration": 5.0,
        "cc": 2855,
        "image": "/media/ferrari-gto.avif",
        "description": "Announced by Enzo Ferrari in September 1983, and unveiled at the Geneva Motor Show in March 1984, the GTO (also known unofficially with the 288 prefix) sparked off a wave of enthusiasm. The legendary name, the stunning styling by Pininfarina, the engine with its seemingly inexhaustible power (2.8 litres and 8 cylinders) and the widespread use of composite materials, made the GTO the closest thing to a racing car."
    },
    {
        "id": "ferrari_testarossa",
        "name": "Ferrari Testarossa",
        "year": 1984,
        "topSpeed": 290,
        "horsepower": 390,
        "cylinders": 12,
        "acceleration": 5.3,
        "cc": 4942,
        "image": "/media/testarossa.avif",
        "description": "The Paris Motor Show in October 1984 saw the return of the glorious Testarossa as heir to the 512 BBi. Pininfarina’s design broke somewhat with tradition and was striking and innovative. The side intakes were larger than on the previous model and this constraint saw the introduction of the long side strakes that would become the Testarossa’s most recognisable feature."
    },
    {
        "id": "ferrari_308_gtb",
        "name": "Ferrari 308 GTB",
        "year": 1975,
        "topSpeed": 252,
        "horsepower": 255,
        "cylinders": 8,
        "acceleration": 6.5,
        "cc": 2927,
        "image": "/media/308-gtb.avif",
        "description": "The 308 GTB made its debut at the Paris and London shows in 1975. Built to a Pininfarina design by Scaglietti, it retained the 308 GT4′s V8, albeit with dry sump lubrication. The latter made for lower engine mounting and better cooling thanks to the fact that more oil was present. The first models boasted fibreglass coachwork."
    },
    {
        "id": "ferrari_330_p4",
        "name": "Ferrari 330 P4",
        "year": 1967,
        "topSpeed": 320,
        "horsepower": 450,
        "cylinders": 12,
        "acceleration": 4.2,
        "cc": 3967,
        "image": "/media/330-p4.avif",
        "description": "With styling very similar to that of the 330 P3, this model was powered by a V12 engine that had been radically redesigned by Franco Rocchi. The most obvious modification was the introduction of a three-valve cylinder head – two inlet and one exhaust. Fuel feed was provided by a Lucas injection system. The chassis was slightly shorter than the 330 P3’s, and the new suspension system improved roadholding. The car won numerous races and earned its place in the history books after a memorable 1-2-3 at Daytona."
    },
    {
        "id": "ferrari_575_maranello",
        "name": "Ferrari 575 Maranello",
        "year": 2002,
        "topSpeed": 325,
        "horsepower": 515,
        "cylinders": 12,
        "acceleration": 4.2,
        "cc": 5748,
        "image": "/media/575m-maranello.jpg",
        "description": "The 2002 launch of the 575M Maranello signals a whole new level of achievement for one of Ferrari’s most traditional layouts – the V12 front-engined rear-wheel drive berlinetta."
    },
    {
        "id": "ferrari_enzo",
        "name": "Ferrari Enzo",
        "year": 2002,
        "topSpeed": 355,
        "horsepower": 651,
        "cylinders": 12,
        "acceleration": 3.1,
        "cc": 5998,
        "image": "/media/ferrari-enzo.jpg",
        "description": "Over the years Ferrari has introduced a series of supercars which have represented the very pinnacle of the company’s technological achievements transferred to its road cars. These include the GTO, F40 and F50. This family of extreme performance cars was joined in 2002 by the Enzo Ferrari, which was the expression of the latest Formula 1 technology and know-how."
    },
    {
        "id": "ferrari_f430",
        "name": "Ferrari F430",
        "year": 2004,
        "topSpeed": 315,
        "horsepower": 490,
        "cylinders": 8,
        "acceleration": 4.0,
        "cc": 4308,
        "image": "/media/f430.avif",
        "description": "The F430 hails the arrival of a whole new generation of Ferrari V8-engined berlinettas. Every inch of the car was inspired by the engineering research carried out at Ferrari’s Gestione Sportiva F1 Racing Division. The result is a highly innovative design characterised by cutting-edge technologies perfected for use on a road-going car."
    },
    {
        "id": "ferrari_599_gtb",
        "name": "Ferrari 599 GTB",
        "year": 2006,
        "topSpeed": 335,
        "horsepower": 612,
        "cylinders": 12,
        "acceleration": 3.7,
        "cc": 5999,
        "image": "/media/Ferrari599.jpg",
        "description": "The Ferrari 599 GTB Fiorano was designed with several specific objectives in mind: to increase driving pleasure, to guarantee performance (courtesy of technology transfers from the F1 single-seaters), and to ensure comfort, ergonomics and safety. The Ferrari 599 GTB Fiorano sprints from 0 to 100 km/h in 3.7 seconds and has a top speed in excess of 330 km/h. The car takes its name from the Fiorano circuit Ferrari uses to hone the performance of its track and road cars. ‘GTB’ stands for Gran Turismo Berlinetta, after the most famous Ferrari berlinettas ever built, and ’599′ is the displacement of the V12 engine divided by 10."
    },
    {
        "id": "ferrari_california",
        "name": "Ferrari California",
        "year": 2008,
        "topSpeed": 310,
        "horsepower": 453,
        "cylinders": 8,
        "acceleration": 3.9,
        "cc": 4297,
        "image": "/media/california.avif",
        "description": "The Ferrari California  satisfies even the most demanding of owners in term of its superb vehicle dynamics and driving pleasure."
    },
    {
        "id": "ferrari_laferrari",
        "name": "Ferrari LaFerrari",
        "year": 2013,
        "topSpeed": 350,
        "horsepower": 950,
        "cylinders": 12,
        "acceleration": 2.6,
        "cc": 6262,
        "image": "/media/laferrari.jpg",
        "description": "It boasts the most extreme performance ever achieved by a Ferrari production car and features the most advanced and innovative technical solutions which will, in the future, filter down to the rest of the Ferrari range. The LaFerrari is Ferrari’s first ever production car to be equipped with the F1-derived hybrid solution – the HY-KERS system – which combines an electric motor producing over 150 CV with the most powerful incarnation yet of Ferrari’s classic V12, with 800 CV at 9000 rpm."
    },
    {
        "id": "ferrari_488_gtb",
        "name": "Ferrari 488 GTB",
        "year": 2015,
        "topSpeed": 330,
        "horsepower": 661,
        "cylinders": 8,
        "acceleration": 3.0,
        "cc": 3902,
        "image": "/media/Ferrari_488.jpg",
        "description": "The 488 GTB name marks a return to the classic Ferrari model designation with the 488 in its moniker indicating the engine's unitary displacement, while the GTB stands for Gran Turismo Berlinetta."
    },
    {
        "id": "ferrari_portofino",
        "name": "Ferrari Portofino",
        "year": 2017,
        "topSpeed": 320,
        "horsepower": 591,
        "cylinders": 8,
        "acceleration": 3.5,
        "cc": 3855,
        "image": "/media/portofino.avif",
        "description": "Ferrari has chosen a particularly evocative moniker for this exceptionally versatile drop-top car, referencing one of Italy’s most beautiful towns. Portofino is renowned for its charming tourist port and, over the years, has become internationally synonymous with elegance, sportiness and understated luxury. The launch colour of the new Ferrari has also been dedicated to this marvellous town: Rosso Portofino. A Ferrari designed to be driven every day that also effortlessly converts from an authentic ‘berlinetta’ coupé to a drop-top capable of delivering a unique Ferrari soundtrack and superb driving pleasure even in day-to-day situations. "
    },
    {
        "id": "ferrari_f8_tributo",
        "name": "Ferrari F8 Tributo",
        "year": 2019,
        "topSpeed": 340,
        "horsepower": 710,
        "cylinders": 8,
        "acceleration": 2.9,
        "cc": 3902,
        "image": "/media/f8-tributo.jpg",
        "description": "The Ferrari F8 Tributo is the new mid-rear-engined sports car that represents the highest expression of the Prancing Horse’s classic two-seater berlinetta. It is a car with unique characteristics and, as its name implies, is an homage to the most powerful V8 in Ferrari history."
    },
    {
        "id": "ferrari_335_s",
        "name": "Ferrari 335 S",
        "year": 1957,
        "topSpeed": 300,
        "horsepower": 390,
        "cylinders": 12,
        "acceleration": 4.1,
        "cc": 4023,
        "image": "/media/335s.avif",
        "description": "The direct descendant of the 315 S, the 335 S made its debut at the infamous 1957 Mille Miglia with Alfonso De Portago replacing an unwell Luigi Musso at the wheel at the last minute. The car was lying third when tragedy struck near Guidizzolo, killing De Portago, his co-driver Edmond Nelson and 14 spectators. The ensuing barrage of protests brought the era of high-speed road racing to an end in Italy. The 335 S also took part in the Le Mans 24 hour, turning in the fastest lap at an average of over 120 mph. In addition to this, it took the first two places at the Venezuelan 1000 km, thus contributing to Ferrari’s victory in the Manufacturers’ World Championship."
    }
]
